'''
    一、数据屋概述.数据库简介
        1.教据管理技术发展
            人工管理
            文件管理
            数据库系统笞理
        2.数据库相关概念
            1.数据描述事物的符号 例如文本 文宇 图片 音颊 视颊等
            2.教据库 例如车库 粮库 存储装据
            3.数据库管理系统对数据库中数据进行管理
                流行的关系型数据库有(oracle MysQL DB2 sQL Server)
            4.数据库应川程序
                最终用户使用的应用程序，在数据库管理系j基础上，带有图形化界面的应用程序
            5.教据库管理员
                对数据库系统操作的人员，主要负责对数据库进行运营和维护
            6.最篓用户
                对数据库应川程序的使川者
            7.数据库系统﹑由数据库 数据库管理系统 数据库应用程序 数据库管理员 最终用户构成
        3.什么是SQL语言
            SQL：结构化查询语言简称
            a.DQL 川于对数据库查询 select from where
            b.DML 用于对教据的增 删除 修改
            c.DDL 用丁对教据库中对象(表、索引、视图、触发器、函数等)增 删除 修改
            d.DCL 用于对教据库权限授予和问收
            e.TCL 用于对数据库事物 开启 提交 回滚
    二、MySQL简介
        1.数据库分类
        a.关系型数据库(二维表)
            oracle
                由oracle（甲骨文）公司开发
                优点:性能高安全性高
                缺点:管理维护操作复杂收费价格昂贵
            MySQL
                最初是出MySQL AB公司开发,最后被oracle公司收购
                优点：开源的 体积小 速度快 成本低
            DB2
                IBM公司
                优点:稳定性 交全性好
                缺点:使用起来出较繁琐 适合大型应用系统
            sQLServer
                由微软开发
                优点：功能全面效率高
                缺点:只能在windows系统下运行
        b.非关系型数据库(NOsQL)not only sql
            解决超大规模和高产发性 MongoDB Redis


'''